# Напишите функцию, которая принимает строку круглых скобок
# Если круглая скобка открыта, но не закрыта, то функцию возвращает False.
# Порядок скобок в строке может быть разным!

# Например:
#   "()"              ->  true
#   ")(()))"          ->  false
#   "("               ->  false
#   "(())((()())())"  ->  true
#   ")("              ->  false
#   ""                ->  true

# Ограничения
#   - длина строки <= 100
#   - строка состоит только из символов '(', ')'
#   - строка состоит только из символов '(', ')'
#   - пустая строка возвращает True 
#   - пустая строка возвращает True 



# ################################
# Напишите ту же функцию, которая принимала бы и текст со скобками
# Например:
#   string = 'hi(hi)()'     ->  true
#   string = 'hi())('       ->  false
#   string = '((())()())'   ->  true

