# Задача 1.1.

# Есть строка с перечислением песен

my_favorite_songs = 'Waste a Moment, Staying\' Alive, A Sorta Fairytale, Start Me Up, New Salvation'


# Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
# Нельзя переопределять my_favorite_songs и запятая не должна выводиться.
print(f'первый трек {my_favorite_songs[0, 15]')
print(f'последний трек {my_favorite_songs[-1, -14])
print(f'второй трек {my_favorite_songs[17, 32])
print(f'второй трек в конца {my_favorite_songs[-16, -28])
